hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_82_2.h
    }
    
    // -- Custom interrupt handler
    static IRAM_ATTR void interruptHandler(void *arg)
    {
        
        /*
         if (i2s->int_st.out_eof) {
         i2s->int_clr.val = i2s->int_raw.val;
         
         if ( ! gDoneFilling) {
         fillBuffer6();
         } else {
         portBASE_TYPE HPTaskAwoken = 0;
         xSemaphoreGiveFromISR(gTX_sem, &HPTaskAwoken);
         if(HPTaskAwoken == pdTRUE) portYIELD_FROM_ISR();
         }
         }*/
        
        //Lines pixel[3];
        if (!i2s->int_st.out_eof)
            return;
        i2s->int_clr.val = i2s->int_raw.val;
        
        
        if(stopSignal)
        {
            // Serial.println("stop");
            i2sStop();
            runningPixel=false;
            return;
        }
        if(ledToDisplay<=NUM_LEDS_PER_STRIP)
        {
            
            
            
            
            
            
            if(ledToDisplay==NUM_LEDS_PER_STRIP)
            {
                pu( (uint16_t*)dmaBuffers[dmaBufferActive]->buffer);
                
                
                /*i2sStop();
                 runningPixel=false;
                 return;*/
                stopSignal=true;
            }
            //  long time3=ESP.getCycleCount();
            fillbuffer6((uint16_t*)dmaBuffers[dmaBufferActive]->buffer);
            //   time3=ESP.getCycleCount()-time3;
            //   if(countfps<time3)
            //      countfps=time3;
            //  nbp++;
            ledToDisplay++;
            dmaBufferActive = (dmaBufferActive + 1)% 2;
            //if(ledToDisplay)
        }
        else
        {
            //if no more pixels then we will read the other buffer and stop
            // if(ledToDisplay==nun_led_per_strip)
            //   ledToDisplay++;
            //if(ledToDisplay==nun_led_per_strip+1)
            stopSignal=true;
        }
    }
    
    
    
    static    void transpose16x1_noinline2(unsigned char *A, uint8_t *B) {
        uint32_t  x, y, x1,y1,t;
        
        
        
        y = *(unsigned int*)(A);
        x = *(unsigned int*)(A+4);
        y1 = *(unsigned int*)(A+8);
        //x1=0;
        x1 = *(unsigned int*)(A+12);
        
        
        
        
        // pre-transform x
        t = (x ^ (x >> 7)) & AA;  x = x ^ t ^ (t << 7);
        t = (x ^ (x >>14)) & CC;  x = x ^ t ^ (t <<14);
        t = (x1 ^ (x1 >> 7)) & AA;  x1 = x1 ^ t ^ (t << 7);
        t = (x1 ^ (x1 >>14)) & CC;  x1 = x1 ^ t ^ (t <<14);
        // pre-transform y
        t = (y ^ (y >> 7)) & AA;  y = y ^ t ^ (t << 7);
        t = (y ^ (y >>14)) & CC;  y = y ^ t ^ (t <<14);
        t = (y1 ^ (y1 >> 7)) & AA;  y1 = y1 ^ t ^ (t << 7);
        t = (y1 ^ (y1 >>14)) & CC;  y1 = y1 ^ t ^ (t <<14);
        
        
        // final transform
        t = (x & FF) | ((y >> 4) & FF2);
        y = ((x << 4) & FF) | (y & FF2);
        x = t;
        
        t= (x1 & FF) | ((y1 >> 4) & FF2);
        y1 = ((x1 << 4) & FF) | (y1 & FF2);
        x1 = t;
        
        
        /*
         *((uint16_t*)B) = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
         B-=offset;
         //B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
         B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((y & 0xff0000) |((y1&0xff0000) <<8))>>16);
         B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
         B-=offset;
         *((uint16_t*)B) =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
         B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
         B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((x & 0xff0000) |((x1&0xff0000) <<8))>>16);
         B-=offset;
         *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
         */
        
        // *((uint16_t*)(B)) = (uint16_t)(   (   (x & 0xff000000) >>24 |  (  (x1 & 0xff000000) >>16)   )  );
        // *((uint16_t*)(B+4*48)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
        //*((uint8_t*)(B))=*((uint8_t*)(&x)+3);
        //*((uint8_t*)(B+1))=*((uint8_t*)(&x1)+2);
        
        
        
        // B[0]= (uint16_t)(   (   (x & 0xff000000) >>24 |  (  (x1&0xff000000) >>16)   )  );
        //B+=48;//offset;
        *((uint16_t*)(B+48)) = (uint16_t)( ((x & 0xff0000) >>16|((x1&0xff0000) >>8)));
        // B[48] = (uint16_t)( ((x & 0xff0000) >>16|((x1&0xff0000) >>8)));
        //+=48;//offset;
        *((uint16_t*)(B+2*48)) = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
        // B[2*48]  = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
        // B+=48;//offset;
        *((uint16_t*)(B+3*48)) =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
        // B[3*48] =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
        //B+=48;//offset;
        
        
        *((uint16_t*)(B+4*48)) = (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
        // B[4*48]= (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
        
        *((uint16_t*)(B+5*48)) = (uint16_t)(((y & 0xff0000) |((y1&0xff0000) <<8))>>16);
        
        
        *((uint16_t*)(B+6*48)) = (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
        //  *((uint16_t*)(B+6*48)) = (uint16_t)(( ((y & 0xff00)>>8) |((y1&0xff00) )));
        
        // B[6*48]=    (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
        
        
        *((uint16_t*)(B+7*48)) = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
        //  B[7*48]  = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
        
    }
    
    
    
    static void fillbuffer6(uint16_t *buff)
    {
        //return;
        //return;
        //uint16_t *g;
        //  g=buff;
        Lines firstPixel[3];
        
        volatile CRGB * poli;
        // Lines secondPixel[3];
        //    int nblines=5;
        
        //  int nbpins=20;//    this->nbpins;
        
        
        // uint32_t l2=ledToDisplay;
        // poli=int_leds+ledToDisplay;
        //Serial.println(ledToDisplay);
        // uint32_t offset=OFFSET;//(NUM_VIRT_PINS+1)+1-1;//(7)*(NUM_VIRT_PINS+1)*3+2*NUM_VIRT_PINS+1;
        buff+=OFFSET;
        poli=int_leds+ledToDisplay;
        //uint32_t off=nun_led_per_strip*NUM_VIRT_PINS;
#ifndef STATIC_COLOR_PER_PIN
        for(int pin=0;pin<NBIS2SERIALPINS;pin++) {
            
